app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asd"], ["user_id", 1], ["created_at", 2017-03-30 23:06:10 UTC], ["updated_at", 2017-03-30 23:06:10 UTC], ["picture", "\"\\\"think.png\\\"\""]]